'''Пользователь вводит строку текста. Посчитайте, сколько в ней
уникальных символов. Подсказка: нужно преобразование строки
с помощью set(string).'''

print(len(set(input("Введите строку текста:\n"))))